const username = prompt('Як вас звати'); // запитуєм імя користувача
console.log(`Привіт ${username}`); // виводимо привітання в консоль

const age = prompt('вкажіть рік вашого народження'); // запитуєм рік народження користувача
const year = 2023; // поточний рік
console.log(`Ваш вік ${year-age}`); //виводимо в консоль вік користвувача

const sideOfSquare = prompt ('вкажіть сторону квадрату в сантиметрах'); //користувач вводить данні 
console.log(`Периметр ${sideOfSquare*4} см`); // виводимо в консоль результат обчислення

const radius = prompt ('вкажіть радіус кола у сантиметрах'); // користувач вводить радіус
console.log(`Площа кола ${Math.PI*(radius*radius)}`); // виводимо в консоль площу кола

const distance = prompt ('Вкажіть відстань між містами в кілометрах'); // користувач вводить данні в км
const time = prompt ('Вкажіть час за який ви хочете доїхати в годинах'); // користувач вводить данні час в год
console.log(`Необхідна швидкість ${distance/time} км/год`); // розрахунок швидкості

const dollar = prompt ('Скільки Долярів маш на кармані?'); // користувач вводить суму
const kurs = 0.92; // курс поточний на 26.11.2023
console.log(`${dollar*kurs} Євро`); // обрахунок кількості в Євро

